---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures.CannotDrawRevolution
source: html/27a5eee6-0228-f0ca-2a59-b77606f5827b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures.CannotDrawRevolution Property

Can't create surface of revolution.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawRevolution { get; }
```